Repository: yasielpv/pkp-ark-pubid
Catalog: locale/*/locale.po
Languages: es_es

# plugins.pubIds.ark.description
source: This plugin enables the assignment of the Archival Resource Key to the issues, articles and galleys in OJS.
es_es: Este módulo activa la asiganción de ARK (Archival Resource Key) de los números, artículos y galeradas en OJS.

# plugins.pubIds.ark.manager.settings.description
source: Please configure the ARK plugin to be able to manage and use ARKs in OJS:
es_es: Configura el módulo ARK para poder administrar y usar ARKs en OJS:

# plugins.pubIds.ark.manager.settings.arkObjects
source: Journal Content
es_es: Contenido de la revista

# plugins.pubIds.ark.manager.settings.arkObjectsRequired
source: Please choose the objects ARKs should be assigned to.
es_es: Escoja los objetos a los que asignar ARKs.

# plugins.pubIds.ark.manager.settings.explainARKs
source: Please select the publishing objects that will have Archival Resource Key (ARK) assigned:
es_es: Escoja los objetos publicados al los que asignar ARK (Archival Resource Key):

# plugins.pubIds.ark.manager.settings.enableIssueARK
source: Issues
es_es: Números

# plugins.pubIds.ark.manager.settings.enableRepresentationARK
source: Galleys
es_es: Galeradas

# plugins.pubIds.ark.manager.settings.arkPrefix
source: ARK Prefix
es_es: Prefijo ARK

# plugins.pubIds.ark.manager.settings.arkPrefix.description
source: The ARK prefix is the fix, never changing part of the ARK (e.g. "ark:/00000").
es_es: El prefijo ARK es la parte no cambiante del ARK (p.ej. "ark:/00000").

# plugins.pubIds.ark.manager.settings.form.arkPrefixPattern
source: The ARK prefix pattern must be in the form "ark:/"&lt;NAAN&gt;.
es_es: El patrón del prefijo ARK debe seguir el formato "ark:/"&lt;NAAN&gt;.

# plugins.pubIds.ark.manager.settings.arkSuffix
source: ARK Suffix
es_es: Sufijo ARK

# plugins.pubIds.ark.manager.settings.arkSuffix.description
source: A ARK suffix can take any form, but must be unique among all publishing objects with the same ARK prefix assigned:
es_es: El sufijo ARK pude tomar cualquier forma, pero debe ser único entre todos los objetos publicados bajo un mismo prefijo ARK:

# plugins.pubIds.ark.manager.settings.arkSuffixPattern
source: Use the pattern entered below to generate ARK suffixes. Use %j for journal initials, %v for the volume number, %i for the issue number, %s para el ID del n√∫mero, %Y for the year, %a for the OJS article ID, %g for the OJS galley ID, %f for the OJS file ID, %p for the page number and %x for "Custom Identifier".
es_es: Indique el patrón que desea emplear para generar sufijos ARK. Utilice %j para las iniciales de la revista, %v para el número de volúmen, %i para el número de número, %s para el ID del número, %Y para el año, %a para el ID de artículo, %g para el ID de galerada, %f para el ID de fichero, %p para el número de página y %x para el "Identificador personalizado"

# plugins.pubIds.ark.manager.settings.arkSuffixPattern.example
source: For example, vol%viss%ipp%p could create the ARK suffix "vol3iss2pp230".
es_es: Por ejemplo, vol%viss%ipp%p crearía el sufijo ARK "vol3iss2pp230".

# plugins.pubIds.ark.manager.settings.arkSuffixPattern.issues
source: for issues
es_es: para números

# plugins.pubIds.ark.manager.settings.arkSuffixPattern.submissions
source: for articles
es_es: para artículos

# plugins.pubIds.ark.manager.settings.arkSuffixPattern.representations
source: for galleys
es_es: para galeradas

# plugins.pubIds.ark.manager.settings.arkIssueSuffixPatternRequired
source: Please enter the ARK suffix pattern for issues.
es_es: Introduzca el patrón de sufijo ARK para los números.

# plugins.pubIds.ark.manager.settings.arkSubmissionSuffixPatternRequired
source: Please enter the ARK suffix pattern for articles.
es_es: Introduzca el patrón de sufijo ARK para los artículos.

# plugins.pubIds.ark.manager.settings.arkRepresentationSuffixPatternRequired
source: Please enter the ARK suffix pattern for galleys.
es_es: Introduzca el patrón de sufijo ARK para las galeradas.

# plugins.pubIds.ark.manager.settings.arkSuffixDefault
source: Use default patterns.
es_es: Usar los patrones por defecto.

# plugins.pubIds.ark.manager.settings.arkSuffixDefault.description
source: %j.v%vi%i for issues<br />%j.v%vi%i.%a for articles<br />%j.v%vi%i.%a.g%g for galleys.
es_es: %j.v%vi%i para números<br />%j.v%vi%i.%a para artículos<br />%j.v%vi%i.%a.g%g para galeradas.

# plugins.pubIds.ark.manager.settings.arkSuffixCustomIdentifier
source: Enter an individual ARK suffix for each published item. You'll find an additional ARK input field on each item's metadata page.
es_es: Introduzca un sufijo ARK individual para cada item publicado. Encontrará un campo adicional para el ARK en la pàgina de metadatos de cada item.

# plugins.pubIds.ark.manager.settings.arkResolver
source: Resolver URL
es_es: URL de resolución

# plugins.pubIds.ark.manager.settings.arkResolver.description
source: (e.g. https://n2t.net/)
es_es: (p.ej. https://n2t.net/)

# plugins.pubIds.ark.manager.settings.form.arkResolverRequired
source: Please enter the resolver URL.
es_es: Introduzca la URL de resolución.

# plugins.pubIds.ark.manager.settings.arkReassign
source: Reassign ARKs
es_es: Reasignar ARKs

# plugins.pubIds.ark.manager.settings.arkReassign.description
source: If you change your ARK configuration, ARKs that have already been assigned will not be affected. Once the ARK configuration is saved, use this button to clear all existing ARKs so that the new settings will take effect with existing objects.
es_es: Si cambia su configuración ARK, los ARKs ya asignados no se verán afectadas. Cuando guarde la configuración ARK, podrá usar este botón para limpiar los ARKs existentes, de forma que la nueva configuración tenga efecto para todos los objetos exitentes.

# plugins.pubIds.ark.manager.settings.arkReassign.confirm
source: Are you sure you wish to delete all existing ARKs?
es_es: ¿Está seguro/a de que querer borrar todos los ARKs existentes?

# plugins.pubIds.ark.editor.arkObjectTypeIssue
source: issue
es_es: número

# plugins.pubIds.ark.editor.arkObjectTypeSubmission
source: article
es_es: artículo

# plugins.pubIds.ark.editor.arkObjectTypeRepresentation
source: galley
es_es: galerada

# plugins.pubIds.ark.editor.customSuffixMissing
source: The ARK cannot be assigned because the custom suffix is missing.
es_es: No se puede asignar un ARK porque falta el sufijo personalizado.

# plugins.pubIds.ark.editor.patternNotResolved
source: The ARK cannot be assigned because it contains an unresolved pattern.
es_es: No se puede asignar un ARK porque contiene patrones sin resolver.

# plugins.pubIds.ark.editor.canBeAssigned
source: What you see is a preview of the ARK. Select the checkbox and save the form to assign the ARK.
es_es: Lo que se muestra es una vista previa del ARK. Seleccione la casilla de verificación y guarde el formulario para asignar el ARK.

# plugins.pubIds.ark.editor.assigned
source: The ARK is assigned to this {$pubObjectType}.
es_es: El ARK asignado a este {$pubObjectType}.

# plugins.pubIds.ark.editor.arkSuffixCustomIdentifierNotUnique
source: The given ARK suffix is already in use for another published item. Please enter a unique ARK suffix for each item.
es_es: El sufijo ARK dado ya está en uso para otro elemento publicado. Ingrese un sufijo ARK único para cada elemento.

# plugins.pubIds.ark.editor.clearObjectsARK
source: Clear ARK
es_es: Limpiar ARK

# plugins.pubIds.ark.editor.clearObjectsARK.confirm
source: Are you sure you wish to delete the existing ARK?
es_es: ¿Está seguro/a de querer borrar todos los ARK existentes?

# plugins.pubIds.ark.editor.clearIssueObjectsARK
source: Clear Issue Objects ARKs
es_es: Limpiar ARKs de los Objetos del Número

# plugins.pubIds.ark.editor.clearIssueObjectsARK.confirm
source: Are you sure you wish to delete the existing issue objects ARKs?
es_es: ¿Está seguro/a de querer borrar todos los ARKs de los objetos del número?

# plugins.pubIds.ark.editor.clearIssueObjectsARK.description
source: Use the following option to clear ARKs of all objects (articles and galleys) currently scheduled for this issue.
es_es: Use la siguiente opción para limpiar los ARKs de todos los objetos (artículos y galerias) actualmente programados para este número.

# plugins.pubIds.ark.editor.assignARK
source: Assign the ARK {$pubId} to this {$pubObjectType}
es_es: Asignar el ARK {$pubId} a este {$pubObjectType}

# plugins.pubIds.ark.editor.assignARK.emptySuffix
source: The ARK cannot be assigned because the custom suffix is missing.
es_es: El ARK no se puede asignar porque falta el sufijo personalizado.

# plugins.pubIds.ark.editor.assignARK.pattern
source: The ARK {$pubId} cannot be assigned because it contains an unresolved pattern.
es_es: El ARK {$pubId} no se puede asignar porque contiene patrones sin resolver.

# plugins.pubIds.ark.editor.assignARK.assigned
source: The ARK {$pubId} has been assigned.
es_es: Se ha asignado el ARK {$pubId}.
